# 변수는 저장공간

# 자료형(type)

#정수형 (int)
#실수형 (float)
#문자열 (str)
#논리형 (bool)

# 변수의 선언(메모리 할당)
#변수명 = 값(초기값)
# 초기값을 넣는 작업=초기화

# 변수 선언시 RAM
# x=0    x라는 이름의 저장공간이 RAM에 할당된다.
# x에 0이라는 초기값이 들어간다.
# 주소
# 저장공간이 RAM에 할당되면 고유한 값인 주소값이 부여된다.
# 변수 선언 시 주의사항
# 같은 이름으로 선언할 수 있으나, 두번째 선언은 기존의 변수의 값을 수정할 때 사용된다.
x = 10
x = 20
print(x)
# x는 10이었다가 20으로 수정되었음.
# 초기화를 반드시 해준다.
# 되도록 선언부에 한꺼번에 선언한다(페이지 상단)

# 변수명 주의사항
# 문자부터 시작한다
# 특수문자는 사용할 수 없다. 단, _(언더바)는 사용가능 (공백대신) 팟홀 표기법
# 되도록 소문자를 사용한다
# 되도록 뜻이 있는 단어를 선택한다
# 되도록 한글은 사용하지 않는다

x = 10
print(type(x))

x = 10.9
print(type(x))
# 작은 따옴표와 큰 따옴표의 차이는 없다.
# 모두 str 자료형이다.
name = '김익수'
print(type(name))

name = "홍길동"
print(type(name))

name = "김익수"
age = 10
height = 170
hobby = "piano"

print(name)
print(age)
print(height)
print(hobby)
